{"title": "Tokyo 2020: The elite athletes training at home", "sousTitle": ["'A blessing in disguise'", "Related Topics", "More on this story"], "content": ["By Manish PandeyNewsbeat reporter", "Training with a tin of beans strapped to a pole, or going viral on TikTok for jacuzzi swimming is probably not what athletes preparing for the Olympics and Paralympics had in mind.", "But getting ready for the Tokyo Games has been anything but normal.", "The competition was postponed last year because of the coronavirus pandemic and is now scheduled to take place this summer.", "So what's it been like training in a pandemic? And could training during lockdown make you better prepared for the biggest sporting event in the world?", "Pole-vaulter and British record-holder Holly Bradshaw, and swimmer and gold medallist Jessica-Jane Applegate, told Radio 1 Newsbeat how they've been getting ready for the games.", "When the UK was first placed in lockdown in March last year, Holly missed out on doing 90% of her normal training to prepare for the pole vault.", "\"The only thing I could do was create a gym in the garage. I did a lot of weightlifting to get stronger and have more power,\" the 29-year-old says.", "It required some creative thinking - Holly used the street, some bins and a home-made pole with a tin of beans on the end for weight. ", "\"It was about working my way around it and figuring out the positives,\" she says.", "Champion swimmer Jessica spent \"a good three months (training) on the floor\" at first.", "That was far from ideal, so for the next lockdown a local company let the 24-year-old borrow a giant jacuzzi to train for the Paralympics.", "\"At one end, it's got jet-propelled water against you,\" she says, \"so you can swim against it like a current.\"", "Jessica's unique training methods made their way on to TikTok and her video of training in the snow has had over 24 million views.", "\"It's mind-blowing, absolutely crazy,\" she says. \"I've had so many people message me. I even walked into a Tesco and they recognised me.\"", "Because of the elite athlete exemption introduced at the start of the latest lockdown, which allows competitive athletes to attend gyms for training, Holly does now use normal facilities. ", "But she credits training from home for helping get her \"in the best shape\" of her life.", "\"I feel like if I hadn't spent two, three months getting super strong, maybe I wouldn't be in the best shape now.", "\"So although it's not ideal training from home, it was like a blessing in disguise,\" she adds.", "A post shared by Holly Bradshaw (@hollypv)", "Jessica had the option to move from Norfolk to Manchester and train there using the same exemption as Holly.", "Though she wishes she could be training in a pool rather than the cold, she decided that staying at home would be better for her mental health.", "\"I don't think I would've coped staying in a hotel room, just swimming and not being able to see my family and dogs.", "\"Whereas at home, I've basically built a gym in my dining room. I've got my weights and stuff in there so I can do my workout too,\" she says.", "And Jessica also feels that training during lockdown has helped her to be more resilient.", "\"It's hard sometimes to motivate yourself, but it always feels really good once you've done it.", "\"And that's what motivates me the most - knowing I've done it. And once I've done it, I can just relax,\" she adds.", "Holly agrees, saying the whole experience has taught her to \"make the absolute best\" of the circumstances:", "\"Every time you adapt and overcome, you feel like you're getting more resilient and stronger.\"", "Now, she can't imagine being in a better place heading into an Olympic competition.", "\"So I couldn't really ask for much more,\" she says.", "Follow Newsbeat on Instagram, Facebook, Twitter and YouTube.", "Listen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here. ", "Training for the Tokyo Olympics from your basement", "Tokyo 2020: Meet the Olympic robots", "'I was told racism doesn't exist in 2020'", "‘I couldn’t compete at Tokyo 2020 - but I can in 2021’", "Italy tightens Covid restrictions amid 'new wave'", "Most shops, restaurants and schools will be closed on Monday as Coronavirus infections rise.", "Protest to mark police killing of Breonna Taylor", "UK police officer charged with Sarah Everard murder", "How a woman's death sparked UK soul-searching", "Army of volunteers restore lost photos after tsunami", "How eating online is bringing women freedom. VideoHow eating online is bringing women freedom", "EU closes ranks over Covid surge and vaccine delays", "Why the GameStop story is far from over", "Hungry, angry and fleeing horrors in Mozambique", "Remembering the straight-talking king of the Zulus", "The disinformation tactics used by China", "Striking news pictures from around the world", "Lyrics quiz", "Have you been getting these songs wrong?", "Feeling hot", "What happens to your body in extreme heat?", "Italy tightens Covid restrictions amid 'new wave'1", "Actress stages naked protest at 'French Oscars'2", "Met officer in court over Sarah Everard death3", "Racist slur overheard as basketball players kneel4", "EU closes ranks over Covid surge and vaccine delays5", "Moscow police detain 200 people at opposition forum6", "Sri Lanka moves towards burka ban7", "Pressure mounts as senators tell Cuomo to quit8", "Homemade submarine seized in Spanish drugs raid9", "Bolivia's ex-president arrested for 'coup'10", "© 2021 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking."]}